Revit 2027 API
ItemFactoryBase.NewModelCurveArray Method
 Creates an array of new model line elements.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelCurveArray NewModelCurveArray(
	CurveArray geometryCurveArray,
	SketchPlane sketchPlane
)
Public Function NewModelCurveArray (
	geometryCurveArray As CurveArray,
	sketchPlane As SketchPlane
) As ModelCurveArray
public:
ModelCurveArray^ NewModelCurveArray(
	CurveArray^ geometryCurveArray,
	SketchPlane^ sketchPlane
)
member NewModelCurveArray :
        geometryCurveArray : CurveArray *
        sketchPlane : SketchPlane -> ModelCurveArray
Parameters
geometryCurveArray CurveArray
 An array containing the internal geometry curves for model lines.
sketchPlane SketchPlane
Return Value
ModelCurveArray
 If successful an array of new model line elements. Otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown when curve is not in the plane
See Also
Reference
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace